Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This section gives an example using the Vert.x `WebClient`. As indicated in the table above, add the following dependency to your project:
ja_jp: このセクションでは、Vert.x `WebClient` を使った例を紹介します。上の表にあるように、プロジェクトに以下の依存関係を追加します。

source: This section has two flavors. The first one is using the name `each` and `it` is an implicit alias for the iteration element.
ja_jp: このセクションには 2 つのフレーバーがあります。最初のものは `each` という名前を使い、`it` は反復処理要素の暗黙のエイリアスです。

source: This section is a work in progress and gathers the philosophy under which extensions should be designed and written.
ja_jp: このセクションは作業中であり、エクステンションがどのように設計され、どのように書かれるべきかの哲学を記述します。

source: This section is for extension authors who want to add new JFR events.
ja_jp: このセクションは、新しい JFR イベントを追加したいエクステンション作成者向けです。

source: This section is for those who would like to add new events to this extension.
ja_jp: このセクションは、このエクステンションに新しいイベントを追加したい人向けです。

source: This section is not about virtual threads. Because we need to do some I/O to demonstrate virtual threads usage, we need a client doing I/O operations. In addition, the REST client is virtual thread friendly: it does not pin and handle propagation correctly.
ja_jp: このセクションは仮想スレッドに関するものではありません。 仮想スレッドの使い方を実証するためにI/Oを行う必要があるため、I/O操作を行うクライアントが必要だからです。 さらに、RESTクライアントは仮想スレッドと親和的です。ピンを行わず、伝搬を正しく行います。

source: This section is not about virtual threads. Because we need to do some I/O to demonstrate virtual threads usage, we need a client doing I/O operations. In addition, the reactive REST client is virtual thread friendly: it does not pin and handle propagation correctly.
ja_jp: このセクションは仮想スレッドに関するものではありません。 仮想スレッドの使い方を実証するためにI/Oを行う必要があるため、I/O操作を行うクライアントが必要です。 さらに、リアクティブ REST クライアントは仮想スレッドフレンドリーです。

source: This section is not an explanation of the reactive model. Refer to that xref:quarkus-reactive-architecture.adoc[the Quarkus Reactive Architecture] for more details.
ja_jp: このセクションはリアクティブモデルの説明ではありません。詳細については、 xref:quarkus-reactive-architecture.adoc[Quarkusリアクティブアーキテクチャ] を参照してください。

source: This section is only for extension developers. An extension can register a certificate in the TLS registry. This is useful when an extension needs to provide a certificate to the application or provides a different format.
ja_jp: このセクションはエクステンション開発者専用です。 エクステンションは、TLS レジストリーに証明書を登録できます。 これは、エクステンションがアプリケーションに証明書を提供する必要がある場合、または異なるフォーマットを提供する場合に便利です。

source: This section is provided as high level guidance, but can't presume to be comprehensive as some flags are controlled dynamically by the extensions, the platform you're building on, configuration details, your code and possibly a combination of any of these.
ja_jp: このセクションは高レベルのガイダンスとして提供されていますが、フラグのいくつかはエクステンションや構築しているプラットフォーム、設定の詳細、あなたのコード、そしておそらくこれらの組み合わせによって動的に制御されるため、包括的なものとは考えられません。

source: This section is provided as high level guidance, but can't presume to be comprehensive as some flags are controlled dynamically by the extensions, the platform you're building on, configuration details, your code and possibly a combination of these.
ja_jp: このセクションは、高レベルのガイダンスとして提供されています。フラグの中には、エクステンションや構築しているプラットフォーム、設定の詳細、あなたのコード、そして場合によってはこれらの組み合わせによって動的に制御されものがあるため、このセクションは包括的なものではありません。

source: This section is similar to Java's `switch` or Kotlin's `when` constructs. It matches a _tested value_ against all blocks sequentially until a condition is satisfied. The first matching block is executed. All other blocks are ignored (this behavior differs to the Java `switch` where a `break` statement is necessary).
ja_jp: このセクションは、Java の `switch` や Kotlin の `when` に似ています。条件が満たされるまで、 _テストされた値_ をすべてのブロックに対して順次マッチさせます。最初にマッチしたブロックが実行されます。他のすべてのブロックは無視されます(この動作は、 `break` 文が必要な Java `switch` とは異なります)。

source: This section lists all the Dev Services available in the Quarkus Platform.
ja_jp: このセクションでは、Quarkusプラットフォームで利用可能なすべてのDev Servicesについて説明します。

source: This section might also come in handy when we'd like to avoid multiple expensive invocations:
ja_jp: このセクションは、複数の高価な呼び出しを避けたいときにも便利かもしれません。

source: This section provides the configurations to use with popular mail services.
ja_jp: ここでは、一般的なメールサービスで使用するための設定について説明します。

source: This section shows a brief example of using the link:{runonvthread}[@RunOnVirtualThread] annotation. It also explains the various development and execution models offered by Quarkus.
ja_jp: このセクションでは、link:{runonvthread}[@RunOnVirtualThread] アノテーションの簡単な使用例を紹介します。 また、Quarkus が提供するさまざまな開発モデルと実行モデルについても説明します。

source: This section shows how to replace your client with a mock. If you would like to get a more in-depth understanding of how mocking works in Quarkus, see the blog post on https://quarkus.io/blog/mocking/[Mocking CDI beans].
ja_jp: このセクションでは、クライアントをモックに置き換える方法を示します。Quarkus でモッキングがどのように機能するかをより深く理解したい場合は、 https://quarkus.io/blog/mocking/[Mocking CDI beans] のブログ投稿を参照してください。

source: This section tag is also registered under the `set` alias:
ja_jp: このセクションタグも `set` のエイリアスで登録されています。

source: This section used the _imperative_ mailer API. It blocks the caller thread until the mail is sent.
ja_jp: このセクションでは、 _命令型_ mailer APIを使用しました。メールが送信されるまで呼び出し元のスレッドをブロックします。

source: This section uses Mutiny reactive types. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
ja_jp: このセクションでは、Mutinyのリアクティブ型を使用しています。もしMutinyに慣れていない場合は、まず xref:mutiny-primer.adoc[Mutiny - 直感的なリアクティブプログラミングライブラリ] を参照してください。

source: This seems quite a bit, but actually none of those bullet points were major issues, or something we could not work around. Several issues were related to configuration, in part because the program was run as a Tekton task, and there is limited flexibility on how you define optional parameters in Tekton. I have listed only those points that we had to work around. Many issues or questions were actually resolved as we were making progress through answers in the google group, or actual fixes.
ja_jp: これはかなりの量に見えますが、実際にはこれらの箇条書きはどれも大きな問題ではなく、回避できないものでもありませんでした。いくつかの問題は設定に関するものでしたが、これはプログラムがTektonタスクとして実行されていたためで、Tektonではオプションのパラメータを定義する際の柔軟性が限られています。ここに挙げたのは、回避しなければならなかった点のみです。多くの問題や質問は、Google Groupでの回答や実際の修正により、進行中に解決されました。

source: This server endpoint is instantiated for each callback method execution.
ja_jp: このサーバーエンドポイントは、コールバックメソッドの実行ごとにインスタンス化されます。

source: This server endpoint is not shared and is scoped to the session/connection.
ja_jp: このサーバーエンドポイントは共有されず、セッション/接続に限定されます。

source: This server only supports `PEM` format for the certificate and the key.
ja_jp: このサーバーは、証明書とキーに対して `PEM` 形式のみをサポートしています。

source: This service provides scalability out of the box for web applications. If more instances are required, it will provide a load-balancing automatically, plus monitoring, metrics, logging and so on.
ja_jp: このサービスは、Webアプリケーションのスケーラビリティを提供します。より多くのインスタンスが必要な場合は、自動的に負荷分散を行い、監視、メトリクス、ロギングなどを提供します。

source: This sets a floor level for which Quarkus needs to generate supporting code. The minimum log level must be set at build time so that Quarkus can open the door to optimization opportunities where logging on unusable levels can be elided.
ja_jp: これは、Quarkusがサポートコードを生成する必要があるフロアレベルを設定します。 Quarkusに対して使用不可能なレベルのログを省略できる最適化の機会を提供するため、最小ログレベルはビルド時に設定する必要があります。

source: This setting is important when using SNI, because it uses the first specified pair as the default.
ja_jp: この設定は、最初に指定されたペアをデフォルトとして使用するため、SNI を使用する場合に重要です。

source: This setting is security sensitive. Please see https://www.redhat.com/sysadmin/container-image-short-names[Container image short names in Podman] before changing this setting.
ja_jp: この設定はセキュリティ上重要です。この設定を変更する前に、 link:https://www.redhat.com/sysadmin/container-image-short-names[Podmanのコンテナイメージ短縮名]をご覧ください。

source: This setting should not be used in production as it will disable any kind of SSL verification.
ja_jp: この設定は、あらゆる種類のSSL検証を無効にするため、実運用環境では使用しないでください。

source: This setting should not be used in production as it will disable the SSL hostname verification.
ja_jp: この設定は、SSLホスト名検証を無効にするため、本番運用では使用しないでください。

source: This setting will only apply to the current terminal session. To make this configuration persistent, add the line to the profile files of your shell (e.g. `~/.profile`).
ja_jp: この設定は、現在のターミナルセッションにのみ適用されます。この設定を持続させるには、シェルのプロファイルファイルにこの行を追加してください（例： `~/.profile` ）。

source: This setting will only take effect after a reboot.
ja_jp: この設定は、再起動後にのみ有効になります。

source: This short getting started guide has shown you how to create a simple chat application using the `quarkus-websockets-next` extension. Learn more about this extension on the xref:./websockets-next-reference.adoc[dedicated reference guide].
ja_jp: この短いスタートガイドでは、`quarkus-websockets-next` エクステンションを使用して、簡単なチャットアプリケーションを作成する方法について説明しました。 このエクステンションの詳細は、xref:./websockets-next-reference.adoc[専用のリファレンスガイド] を参照してください。

source: This should only be done if the extension depends on a newer version of these artifacts. If the extension does not bring in a replacement artifact as a dependency then classes the application needs might end up missing.
ja_jp: これは、エクステンションがこれらのアーティファクトの新しいバージョンに依存している場合にのみ行うべきです。もしエクステンションが代替アーティファクトを依存関係として持ち込まなかった場合、 アプリケーションが必要とするクラスが見つからなくなってしまうかもしれません。

source: This shows an <<advanced-usage-adding-actions,interactive page>>
ja_jp: これは、 link:#advanced-usage-adding-actions[インタラクティブページ] を示しています。

source: This shows an xref:advanced-usage-adding-actions[interactive page]
ja_jp: これは xref:advanced-usage-adding-actions[インタラクティブなページ] を表示します

source: This shows that most of the memory requested using `malloc` comes from epoll in Java NIO, but the overall amount allocated via `malloc` is barely 268KB. This amount of 274,269 bytes can be observed by hovering on top of `all` at the bottom of flamegraph (you might need to ask the browser to open the flamegraph in a different tab or window to observe this). This is very small compared with the amount allocated for the heap with `mmap`.
ja_jp: これは、 `malloc` を使用して要求されたメモリーの大部分が Java NIO の epoll から取得していることを示しています。 しかし、 `malloc` によって割り当てられる量は全体でわずか 268 KB です。 この 274,269 バイトの量は、フレームグラフの下部にある `all` の上にマウスを置くことで確認できます。 (確認するには、ブラウザーに別のタブまたはウィンドウでフレームグラフを開くように要求する必要がある場合があります)。 これは、 `mmap` でヒープに割り当てられた量と比較すると非常に小さいです。

source: This simple template is quite similar to the Handlebars template you created in the the <<vertx-oidc-vertx>> section. Please see the https://quarkus.io/guides/qute-reference[Qute Reference Guide] for more details.
ja_jp: このシンプルなテンプレートは、 <<vertx-oidc-vertx>> セクションで作成した Handlebars テンプレートと非常によく似ています。詳細は https://quarkus.io/guides/qute-reference[Qute リファレンスガイド] を参照してください。

source: This simplifies how you handle an application that supports multiple OIDC providers.
ja_jp: これにより、複数のOIDCプロバイダをサポートするアプリケーションの取り扱いが簡単になります。

source: This simplifies how you handle applications that support multiple OIDC providers.
ja_jp: これにより、複数の OIDC プロバイダーをサポートするアプリケーションの処理が簡素化されます。

source: This single property combination works if your OIDC provider supports the metadata discovery and the incoming bearer access tokens are in JWT format which can be verified by the keys fetched from the provider's JWK endpoint.
ja_jp: この単一のプロパティーの組み合わせは、OIDC プロバイダーがメタデータディスカバリーをサポートし、送られてくるベアラーアクセストークンが、プロバイダーの JWK エンドポイントから取得した鍵で検証可能な JWT 形式である場合に機能します。

source: This snippet shows the request returning an empty json array.
ja_jp: このスニペットは、リクエストが空のjson配列を返すことを示しています。

source: This standardization eliminates confusion and reduces boilerplate while providing a cleaner, more maintainable API.
ja_jp: この標準化により、混乱が解消され、ボイラープレートが削減されるとともに、よりクリーンで保守しやすいAPIが提供されます。

source: This starts the deployment, your test can modify it as part of the test suite. Quarkus will be restarted between each test method so every method starts with a clean deployment.
ja_jp: これによりデプロイメントが開始され、テストスイートの一部として変更できます。Quarkus は各テストメソッド間で再起動されるため、すべてのメソッドはクリーンなデプロイメントで開始されます。

source: This starts your functions in Quarkus dev mode.
ja_jp: これにより、Quarkus 開発モードで Function が起動されます。

source: This state contains information on the Quarkus Assistant, if it's available and if it's configured and ready to be used. This is useful if you extension provide assistant features and you need to know the state of the assistant.
ja_jp: この状態には、Quarkus Assistant が利用可能であるか、および設定され使用準備が整っているかに関する情報が含まれています。これは、エクステンションがアシスタント機能を提供し、アシスタントの状態を知る必要がある場合に役立ちます。

source: This state is a general state that contains global properties used in Dev UI, and it's mostly use internally. It works exactly the same as any of the states discussed before.
ja_jp: この状態は、Dev UI で使用されるグローバルプロパティーを含む一般的な状態であり、主に内部的に使用されます。これは、以前に説明したどの状態ともまったく同じように機能します。

source: This stategy builds the artifacts outside the {openshift} cluster, locally or in a CI environment, and provides them to the {openshift} build system together with a Dockerfile. The artifacts include JAR files or a native executable. The {openshift} cluster builds the container and provides it as an image stream.
ja_jp: この仕組みは {openshift} クラスタの外、ローカルまたはCI環境でアーティファクトをビルドし、Dockerfileと共に{openshift}ビルドシステムに提供します。アーティファクトにはJARファイルやネイティブ実行ファイルが含まれます。 {openshift} クラスタはコンテナをビルドし、イメージストリームとして提供します。

source: This step is only required for generating native executables targeting non-Linux operating systems. For generating native executables targeting Linux, you can optionally skip this section and <<#container-runtime,use a builder image>> instead.
ja_jp: このステップは、Linux 以外のオペレーティングシステムをターゲットとしたネイティブ実行可能ファイルを生成する場合にのみ必要です。 Linux をターゲットとしたネイティブ実行可能ファイルを生成する場合は、このセクションを省略して代わりに <<#container-runtime,use a builder image>>。

source: This step is required only if your application depends on multiple database drivers. If the application operates with a single driver, this driver is detected automatically.
ja_jp: この手順は、アプリケーションが複数のデータベース・ドライバに依存している場合にのみ必要です。 アプリケーションが単一のドライバで動作する場合、このドライバは自動的に検出されます。

source: This step is required only if your application depends on multiple database drivers. If the application uses a single driver, Quarkus detects that driver automatically.
ja_jp: この手順は、アプリケーションが複数のデータベースドライバーに依存している場合にのみ必要です。 アプリケーションが単一のドライバーを使用する場合、Quarkus はそのドライバーを自動的に検出します。

source: This step is unnecessary for libraries that are dependencies of a Quarkus extension where the extension handles it automatically.
ja_jp: Quarkusエクステンションの依存ライブラリで、エクステンションが自動的に処理する場合は、この手順は不要です。

source: This step shows how two different microservices can coordinate their activities even though they have no coupling. Start a second instance of the hello application on a different port:
ja_jp: このステップでは、2つの異なるマイクロサービスが結合していないにもかかわらず、それぞれのアクティビティを調整する方法を紹介します。helloアプリケーションの2つ目のインスタンスを別のポートで起動します。

source: This still validates the HTTP endpoint, but it's more flexible about the expected output. You should see in your terminal that the tests are now passing.
ja_jp: これは引き続き HTTP エンドポイントを検証しますが、 期待される出力に対してより柔軟になります。 ターミナルでテストが成功したことを確認できます。

source: This strategy builds the artifacts outside the {openshift} cluster, locally or in a CI environment, and provides them to the {openshift} build system together with a Dockerfile. The artifacts include JAR files or a native executable. The container gets built inside the {openshift} cluster and is provided as an image stream.
ja_jp: このストラテジーは{openshift}クラスタの外、ローカルまたはCI環境で成果物をビルドし、Dockerfileと共に{openshift}ビルドシステムに提供します。 成果物にはJARファイルやネイティブ実行ファイルが含まれます。コンテナは{openshift}クラスタ内でビルドされ、イメージストリームとして提供されます。

source: This strategy commits the offset every time a message is acknowledged. This strategy tends to commit often, and so decrease the throughput. However, it also reduces the risk of duplicates if the messages are processed synchronously.
ja_jp: このストラテジーは、メッセージが確認されるたびにオフセットをコミットします。 このストラテジーは頻繁にコミットする傾向があるため、スループットが低下します。 しかし、メッセージが同期的に処理されている場合には、重複のリスクを減らすことができます。

source: This strategy does not commit any offsets to the Kafka broker, so when new partitions get assigned to the consumer, i.e. consumer restarts or consumer group instances scale, the consumer resumes the processing from the latest _checkpointed_ offset with its saved state.
ja_jp: この戦略では、Kafkaブローカーにオフセットをコミットしないため、新しいパーティションがコンシューマーに割り当てられたとき、つまりコンシューマーの再起動やコンシューマーグループのインスタンスがスケールしたときに、コンシューマーは保存した状態で最新の _チェックポイント済み_ オフセットから処理を再開する。

source: This strategy provides very good throughput and can handle asynchronous processing. To enable this strategy configures the channel with:
ja_jp: このストラテジーは非常に優れたスループットを提供し、非同期処理を処理することができます。このストラテジーを有効にするには、チャネルを以下のように設定します:

source: This strategy uses a JAR file as input to the S2I build process, which speeds up the building and deploying of your application.
ja_jp: このストラテジーでは、S2Iビルドプロセスの入力としてJARファイルを使用し、アプリケーションのビルドとデプロイをスピードアップします。

source: This structure contains the name, symbol, and position of the element. To retrieve and store elements into a Mongo collection, you can use the following code:
ja_jp: この構造体には、元素の名前、シンボル、位置が入っています。元素を取得して Mongo コレクションに格納するには、次のようなコードを使います。

source: This structure lets you add all kinds of supporting files required by the executable, such as configuration files, shell completion scripts, man pages, license, readme, and more.
ja_jp: この構造では、設定ファイル、シェル補完スクリプト、マンページ、ライセンス、Readmeなど、実行ファイルに必要なあらゆる種類のサポートファイルを追加することができます。

source: This support is database specific and needs to be implemented in each Dev Service specifically.
ja_jp: このサポートはデータベース固有のものであり、各Dev Serviceごとに実装する必要があります。

source: This support is database specific and needs to be implemented in each dev service specifically.
ja_jp: このサポートはデータベース固有のものであり、各開発サービスで具体的に実装する必要があります。

source: This syntax allows developers to specify that the execution of method of a specific bean will determine if the current user can access the secured method.
ja_jp: この構文により、開発者は、特定の Bean のメソッドの実行によって、現在のユーザーが保護されたメソッドにアクセスできるかどうかを決定するように指定できます。

source: This syntax allows users to check if a parameter (or a field of the parameter) of the secured method is equal to the logged in username.
ja_jp: この構文により、ユーザーは、保護されたメソッドのパラメーター (またはパラメーターのフィールド) がログインしたユーザー名と等しいかどうかを確認できます。

source: This syntax allows users to check if a parameter (or a field of the parameter) of the secured method is equal to the logged-in username.
ja_jp: この構文により、ユーザーは、保護されたメソッドのパラメーター (またはパラメーターのフィールド) がログインしたユーザー名と等しいかどうかを確認できます。

source: This table shows the differences between the two frameworks:
ja_jp: この表は、2 つのフレームワークの違いを示しています。

source: This task depends on `quarkusBuild`, so it will generate the artifact before running the integration tests.
ja_jp: このタスクは `quarkusBuild` に依存しているため、結合テストを実行する前にアーティファクトを生成します。

source: This task depends on `quarkusBuild`, so it will generate the native image before running the native tests.
ja_jp: このタスクは `quarkusBuild` に依存しているため、ネイティブテストを実行する前にネイティブイメージを生成します。

source: This task depends on `quarkusBuild`, so it will generate the native image before running the tests.
ja_jp: このタスクは `quarkusBuild` に依存しているので、テストを実行する前にネイティブイメージを生成します。

source: This task depends on both `test` and `quarkusBuild` tasks. The final artifact will be produced before running tests.
ja_jp: このタスクは `test` と `quarkusBuild` タスクに依存しています。最終的なアーティファクトは、テストを実行する前に生成されます。

source: This task will resolve all the runtime, build time, test and dev mode dependencies of the application to the Gradle cache. Once executed, you will be able to safely run quarkus task with `--offline` flag.
ja_jp: このタスクは、アプリケーションの実行時、ビルド時、テスト、開発モードのすべての依存関係をGradleのキャッシュに解決します。実行すると、 `--offline` フラグを付けて quarkus タスクを安全に実行できるようになります。

source: This technology is considered {extension-status}.
ja_jp: この技術は、{extension-status}と考えられています。

source: This tells JUnit that the Quarkus deployment should fail with a specific exception
ja_jp: これは、Quarkus のデプロイが特定の例外で失敗することを JUnit に伝えます。

source: This tells Quarkus Chicory to generate a `GoCelModule` class at build time from the specified WASM file. The extension will automatically generate Java bytecode from the WebAssembly module, configure the appropriate `MachineFactory` based on the runtime environment, and - in development mode - watch the WASM file for changes to trigger live reload.
ja_jp: これにより、Quarkus Chicory に対して、指定された WASM ファイルからビルド時に `GoCelModule` クラスを生成するように指示します。エクステンションは、WebAssembly モジュールから Java バイトコードを自動的に生成し、実行環境に基づいて適切な `MachineFactory` を構成し、開発モードでは WASM ファイルの変更を監視してライブリロードをトリガーします。

source: This tells Quarkus that you don't want it to start a Dev Service, because you have your own database. You don't need to worry about starting the database, because you're just seeing how to change the configuration.
ja_jp: これは、Quarkus に対して Dev Service を起動しないよう指示するものです。 なぜなら、独自のデータベースを使用するためです。ここでは設定の変更方法を確認しているだけなので、 データベースを起動する必要はありません。

source: This tells Quarkus to use the mutable-jar format. Mutable applications also include the deployment time parts of Quarkus, so they take up a bit more disk space. If run normally they start just as fast and use the same memory as an immutable application, however they can also be started in dev mode.
ja_jp: これは、QuarkusにMutable-jar形式を使用するように指示します。ミュータブルアプリケーションには、Quarkusのデプロイメント時間の部分も含まれているため、より多くのディスクスペースを占有します。普通に実行した場合は、イミュータブルアプリケーションと同じ速度で起動し、同じメモリーを使用しますが、devモードで起動することもできます。

source: This tells RESTAssured to prefix all requests with `/hello`.
ja_jp: これにより、RESTAssured はすべてのリクエストの前に `/hello` を付けます。

source: This template extension method makes it possible to render the following template:
ja_jp: このテンプレート拡張メソッドを使うと、以下のテンプレートをレンダリングすることができます。

source: This test code acquires a token by using a `password` grant from the test `Auth0` domain, which has registered an application with the client id `test-auth0-client`, and created the user `alice` with password `alice`. For a test like this to work, the test `Auth0` application must have the `password` grant enabled. This example code also shows how to pass additional parameters. For `Auth0`, these are the `audience` and `scope` parameters.
ja_jp: このテストコードは、クライアント ID が `test-auth0-client` のアプリケーションを登録し、パスワードが `alice` のユーザー `alice` を作成したテスト `Auth0` ドメインから `password` 許可を使用してトークンを取得します。 このようなテストを機能させるには、テスト `Auth0` アプリケーションで `password` グラントが有効になっている必要があります。 このサンプルコードでは、追加のパラメーターを渡す方法も示しています。 `Auth0` の場合、これらは `audience` および `scope` パラメーターです。

source: This test uses HTTP to directly test our REST endpoint. When the test is run the application will be started before the test is run.
ja_jp: このテストはHTTPを使用して、RESTエンドポイントを直接テストします。テストが実行されると、 テストが実行される前にアプリケーションが開始されます。

source: This test verifies that after solving, all lessons are assigned to a time slot and a room. It also verifies that it found a feasible solution (no hard constraints broken).
ja_jp: このテストは、解決した後、すべてのレッスンがタイムスロットと教室に割り当てられていることを確認します。また、実行可能なソリューション (厳しい制約が破られていない) が見つかったことを確認します。

source: This test verifies that the constraint `TimeTableConstraintProvider::roomConflict`, when given three lessons in the same room, where two lessons have the same timeslot, it penalizes with a match weight of `1`. So with a constraint weight of `10hard` it would reduce the score by `-10hard`.
ja_jp: このテストは、制約 `TimeTableConstraintProvider::roomConflict` が、同じ教室に 3 つのレッスンが指定され、2 つのレッスンのタイムスロットが同じ場合に、一致の重み `1` でペナルティを課すことを確認します。したがって、制約の重みが `10hard` の場合、スコアは `-10hard` 減少します。

source: This time an artificial failure was introduced in the CDI bean: the `CoffeeRepositoryService#getAvailability()` method is going to alternate between two successful and two failed invocations.
ja_jp: 今回は、CDIビーンに人工的な失敗を導入しました。 `CoffeeRepositoryService#getAvailability()` メソッドは、2回の成功と2回の失敗の呼び出しを交互に行うことになります。

source: This time, it writes "Hello from Red!".
ja_jp: 今回は"Hello from Red!"と書かれています。

source: This time, we return a Multi as we want to stream the chunks
ja_jp: 今回は、チャンクをストリーミングしたいので、Multiを返します。

source: This time, you can see our list of legumes.
ja_jp: 今回はマメ科植物の一覧が表示されました。

source: This transformation can be disabled by setting `quarkus.config-tracking.use-user-home-alias-in-paths` to `false`.
ja_jp: この変換は、 `quarkus.config-tracking.use-user-home-alias-in-paths` を `false` に設定することで無効にできます。
